{
  "id": "braised-short-rib",
  "title": "Braised Short Rib",
  "description": "A braised beef short rib that blows every restaurant's version out of the water. Heavy on the black pepper, heavy on the garlic.",
  "canonical": true,
  "tags": ["beef", "braise", "dutch-oven", "winter"],
  "source": "Chef John's Peposa dell'Impruneta, with adaptations",
  "time": {
    "prep": 20,
    "cook": 270
  },
  "servings": {
    "base": 4,
    "unit": "servings"
  },
  "ingredientGroups": [
    {
      "name": "Main Components",
      "items": [
        {
          "quantity": 4,
          "quantityMax": 6,
          "unit": "",
          "item": "bone-in short ribs",
          "note": "alternative: anything with collagen who cares",
          "scalable": true
        },
        {
          "quantity": 3,
          "unit": "tbsp",
          "item": "black pepper",
          "note": "coarsely ground; with quality pepper you don't need separate ground and crushed",
          "scalable": true
        },
        {
          "quantity": 8,
          "unit": "cloves",
          "item": "garlic",
          "note": "most of a head, just use a fuckton",
          "scalable": true
        },
        {
          "quantity": 1,
          "quantityMax": 2,
          "unit": "tbsp",
          "item": "tomato paste",
          "note": null,
          "scalable": true
        },
        {
          "quantity": 2,
          "unit": "cups",
          "item": "Chianti or similar wine",
          "note": null,
          "scalable": true
        }
      ]
    },
    {
      "name": "Herbs & Aromatics",
      "items": [
        {
          "quantity": 4,
          "quantityMax": 5,
          "unit": "",
          "item": "sage leaves",
          "note": null,
          "scalable": false
        },
        {
          "quantity": 3,
          "unit": "sprigs",
          "item": "thyme",
          "note": null,
          "scalable": false
        },
        {
          "quantity": null,
          "unit": "",
          "item": "bay leaves",
          "note": "2-3",
          "scalable": false
        }
      ]
    },
    {
      "name": "Optional Vegetables",
      "items": [
        {
          "quantity": null,
          "unit": "",
          "item": "pearl onions, carrot, celery, onion, bell pepper, potato",
          "note": "add them at the right time, not the wrong one. Onion can be diced and sautéed early to deglaze fond if you've built it. The rest should be large chunks added late — about 1.5 hours of cook time keeps them from turning to mush",
          "scalable": false
        }
      ]
    }
  ],
  "directions": [
    {
      "step": 1,
      "title": "Dry Brine",
      "text": "Heavily salt the short ribs 4–24 hours in advance and refrigerate uncovered. The salt penetrates deep into the meat and makes a real difference."
    },
    {
      "step": 2,
      "title": "Garlic Paste",
      "text": "Turn the garlic into a paste using salt and a mortar and pestle, or use a garlic press. Paste or pressed garlic punches way harder than minced or crushed cloves."
    },
    {
      "step": 3,
      "title": "Prep the Meat",
      "text": "Sear the ribs if you want fond, or skip it. Rub the ribs with the garlic paste and tomato paste."
    },
    {
      "step": 4,
      "title": "Braise",
      "text": "Arrange ribs in a single layer in your Dutch oven. Add wine until it comes almost to the top of the meat — 2 cups minimum, more if needed. Add the herbs and bay leaves. Cover tightly and braise at 300°F, turning every 30 minutes or so. The meat needs 3.5–4.5 hours to become properly tender."
    },
    {
      "step": 5,
      "title": "Optional: Reduce the Sauce",
      "text": "Strain the braising liquid and reduce it over medium heat for 30–60 minutes to thicken. Highly recommended but not required."
    },
    {
      "step": 6,
      "title": "Serve",
      "text": "Serve over polenta or mashed potatoes. Top with parsnip chips if you want."
    }
  ],
  "notes": [
    "Wine only, no beef broth. This is what makes the recipe — comes out way better than broth-based braises.",
    "Short ribs really benefit from a dry brine. Heavily salt them 4–24 hours in advance and let the salt penetrate."
  ],
  "deviations": [
    {
      "what": "Garlic paste or pressed garlic instead of crushed or minced cloves",
      "why": "Paste or pressed garlic punches way harder than typical crushed or minced cloves. It penetrates the meat surface; whole or chunked cloves just sit next to it."
    },
    {
      "what": "Just coarsely ground pepper instead of separate ground and crushed",
      "why": "With quality pepper, one coarse grind gives you both the integration and the texture. Simpler."
    }
  ],
  "log": []
}
