{
  "id": "shrimp-scampi",
  "title": "Shrimp Scampi",
  "subtitle": "Intentionally Imperfect",
  "description": "A hard-seared take on scampi that trades the traditional gentle saute for fond and crust. The MSG is doing the work that shell stock would do in a restaurant version.",
  "canonical": false,
  "tags": ["seafood", "italian", "quick", "weeknight"],
  "source": "Traditional Italian-American, heavily adapted",
  "time": {
    "prep": 15,
    "cook": 10
  },
  "servings": {
    "base": 4,
    "unit": "servings"
  },
  "ingredientGroups": [
    {
      "name": "Shrimp",
      "items": [
        {
          "quantity": 2.5,
          "unit": "lbs",
          "item": "colossal shrimp",
          "note": "head-off, peeled, deveined, no tails — colossal stands up to the sear without overcooking",
          "scalable": true
        },
        {
          "quantity": null,
          "unit": "",
          "item": "salt, black pepper, MSG",
          "note": "to taste",
          "scalable": false
        },
        {
          "quantity": null,
          "unit": "",
          "item": "avocado oil",
          "note": "or similar high-smoke-point oil",
          "scalable": false
        }
      ]
    },
    {
      "name": "Sauce",
      "items": [
        {
          "quantity": 4,
          "unit": "tbsp",
          "item": "butter",
          "note": "see notes - may need 5-6 tbsp",
          "scalable": true
        },
        {
          "quantity": 5,
          "unit": "cloves",
          "item": "garlic, pressed",
          "note": "see notes on pressed vs sliced",
          "scalable": true
        },
        {
          "quantity": null,
          "unit": "",
          "item": "red pepper flakes",
          "note": "pinch",
          "scalable": false
        },
        {
          "quantity": 0.5,
          "unit": "cup",
          "item": "dry white wine",
          "note": null,
          "scalable": true
        },
        {
          "quantity": 1,
          "unit": "",
          "item": "lemon, juiced",
          "note": null,
          "scalable": true
        }
      ]
    },
    {
      "name": "To Finish",
      "items": [
        {
          "quantity": null,
          "unit": "",
          "item": "flat-leaf parsley",
          "note": "roughly chopped",
          "scalable": false
        },
        {
          "quantity": null,
          "unit": "",
          "item": "long pasta",
          "note": "linguine, spaghetti, whatever's in the pantry",
          "scalable": false
        }
      ]
    }
  ],
  "directions": [
    {
      "step": 1,
      "title": "Shrimp",
      "text": "Toss shrimp with salt, pepper, and MSG. Lay out in a single layer on paper towels on a plate - let the surface dry out. Get a stainless steel pan ripping hot with a thin layer of avocado oil. Work in batches — don't overcrowd the pan. Every shrimp needs to make contact with the pan, especially the thick part near where the head was. Sear mostly on one side until you build a deep golden crust and a good fond in the pan, flipping briefly to finish. Pull shrimp out and set aside. They can be slightly underdone; they're going back in later."
    },
    {
      "step": 2,
      "title": "Sauce",
      "text": "Same pan. Add 4 tbsp butter - the water content in the butter will help deglaze the fond as it melts. Add pressed garlic and red pepper flakes, cook until fragrant. Add white wine and lemon juice, let it reduce. It's still going to be liquidy in its final form; that's fine."
    },
    {
      "step": 3,
      "title": "Pasta",
      "text": "Boil your long noodle on the side while the sauce comes together. Drain, reserving a splash of pasta water."
    },
    {
      "step": 4,
      "title": "Combine",
      "text": "Return shrimp to the sauce first. Then pour everything over the pasta with a splash of pasta water. Kill the heat, add parsley, toss everything together."
    }
  ],
  "notes": [
    "The sauce was a little lean at these ratios. Next time, bump butter to 5-6 tbsp, or mount a tablespoon of cold butter into the finished sauce off-heat. The cold butter trick emulsifies and gives it a glossy, clingy consistency instead of pooling.",
    "Deglazing with butter before the wine means the fond dissolves into the fat phase first, carrying more sear flavor into the lipid-soluble side of the sauce. Worth keeping intentional.",
    "Avocado oil for the sear, not butter. Butter burns at the temperatures you need for a proper Maillard sear. Butter is the sauce fat. Oil is the sear fat. Don't combine."
  ],
  "deviations": [
    {
      "what": "Hard sear on colossal shrimp instead of gentle saute",
      "why": "Builds fond in the pan and creates a crispy crust on the shrimp. Different texture profile, richer flavor base for the sauce."
    },
    {
      "what": "Pressed garlic instead of sliced",
      "why": "Pressing releases more allicin — sharper, more pungent, burns faster. Sliced gives a mellower, sweeter presence. Both work; this version wants the punch."
    },
    {
      "what": "MSG instead of shell stock",
      "why": "Traditional restaurant versions sweat shells in butter first, then build sauce in that shrimp-fortified fat. MSG hits the same glutamate baseline with deshelled product and zero extra steps."
    }
  ],
  "log": [
    {
      "date": "2026-01-31",
      "entry": "Sauce ran lean at these ratios. Next time bump butter to 5-6 tbsp, or mount cold butter at the end for emulsification."
    }
  ]
}
